[
{"id": "1",
"cat": "web",
"sub": "back",
"title": "lang",
"name": "laravel",
"source": "/laravel.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "SEFLT STUDY   Syntax: Understand the basic structure of PHP code, including variables, data types, operators, control structures (if/else, loops), and functions. Object-Oriented Programming (OOP): Laravel heavily utilizes OOP concepts like classes, objects, inheritance, polymorphism, and encapsulation. Composer: Learn how to use Composer, PHP's dependency manager. You'll use it to install Laravel itself and any other packages your projects need. Laravel Basics: Installation, Directory Structure, Configuration, Routing,Controllers,Blade Templating Engine, Migrations,Artisan Console,Eloquent ORM (Object-Relational Mapper):"},
{"id": "2",
"cat": "web",
"sub": "back",
"title": "lang",
"name": "node js",
"source": "/node.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "For self-study in Node.js, a strong foundation in JavaScript is essential, encompassing core syntax, asynchronous concepts (callbacks, promises, async/await), closures, and modern ES6+ features; crucial Node.js core concepts include understanding the event loop, working with modules, the file system, HTTP, paths, buffers, streams, and processes; the Node.js ecosystem requires familiarity with NPM and package.json, a web framework like Express.js (covering routing, middleware, requests/responses, and templating), database connectivity (both SQL and NoSQL), and designing/building RESTful APIs."},
{"id": "3",
"cat": "web",
"sub": "back",
"title": "lang",
"name": "php",
"source": "/php.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "For self-study in PHP, a strong foundation is crucial, encompassing core syntax, data structures, and object-oriented programming (OOP); key areas include understanding variables, data types, control structures, functions, classes, and modules, along with working with HTML forms, cookies, and sessions; further exploration involves database connectivity (both SQL and NoSQL), web application security, and the use of frameworks like Laravel or Symfony to streamline development."},
{"id": "4",
"cat": "web",
"sub": "back",
"title": "lang",
"name": "python",
"source": "/python.jpg",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "For self-study in Python, a strong foundation is crucial, encompassing core syntax, data structures, and object-oriented programming (OOP); key areas include understanding variables, data types, control flow, functions, classes, and modules, along with working with file I/O, handling exceptions, and utilizing standard libraries; further exploration involves web frameworks like Django or Flask, database interaction (both SQL and NoSQL), data analysis libraries like Pandas and NumPy, and machine learning libraries like Scikit-learn and TensorFlow."},
{"id": "5",
"cat": "web",
"sub": "back",
"title": "api",
"name": "restfun api",
"source": "/api1.jpg",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "For self-study, a strong foundation is crucial, encompassing core syntax, data structures, and object-oriented programming (OOP); key areas include understanding variables, data types, control structures, functions, classes, and modules. A key area of focus is building RESTful APIs, including understanding HTTP methods, request/response formats, authentication, and security. Further exploration involves database connectivity (both SQL and NoSQL) and the use of frameworks to streamline development."},
{"id": "6",
"cat": "web",
"sub": "back",
"title": "api",
"name": "static api",
"source": "/api2.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Developed beginner-level Static API skills through hands-on experience developing and managing projects over 1 month."},
{"id": "7",
"cat": "web",
"sub": "back",
"title": "lang",
"name": "java",
"source": "/java.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Applied Java skills in several college projects, achieving a beginner-level competency in software development."},
{"id": "8",
"cat": "web",
"sub": "front",
"title": "lang",
"name": "html",
"source": "/html.png",
"level": "Intermediate",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Developed intermediate-level HTML skills through hands-on experience in web development projects during my college education."},
{"id": "9",
"cat": "web",
"sub": "front",
"title": "lang",
"name": "css",
"source": "/css.png",
"level": "Intermediate",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have intermediate-level proficiency in CSS, gained through hands-on experience in web development projects during college."},
{"id": "10",
"cat": "web",
"sub": "front",
"title": "lang",
"name": "javascript",
"source": "/js.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Experienced in utilizing JavaScript for web development during college, demonstrating a foundational understanding of this language."},
{"id": "11",
"cat": "web",
"sub": "front",
"title": "frame",
"name": "react",
"source": "/fr1.png",
"level": "Beginner",
"exp": "1 MonthDeveloped beginner-level React skills through hands-on experience developing the user interface of projects over 1 month.",
"proj": "3 Project",
"context": "Developed beginner-level React skills through hands-on experience developing the user interface of projects over 1 month."},
{"id": "12",
"cat": "web",
"sub": "front",
"title": "frame",
"name": "vue",
"source": "/fr2.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Vue for developing the user interface of projects, achieving a beginner-level competency in front-end development workflows within a 1-month timeframe."},
{"id": "13",
"cat": "web",
"sub": "front",
"title": "frame",
"name": "angular",
"source": "/fr3.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Experienced in utilizing Angular for front-end development over the course of 1 month, demonstrating a foundational understanding of this framework."},
{"id": "14",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "jquery",
"source": "/lb1.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Experienced in utilizing jQuery for enhancing website interactivity over the course of 1 month, demonstrating a foundational understanding of this library."},
{"id": "15",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "tailwind css",
"source": "/lb2.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Tailwind CSS for styling and designing the user interface of projects, achieving a beginner-level competency in front-end development workflows within a 1-month timeframe."},
{"id": "16",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "bootstrap",
"source": "/lb3.jpg",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Bootstrap for designing and developing the user interface of 3 projects, achieving a beginner-level competency in front-end development workflows within a 1-month timeframe."},
{"id": "17",
"cat": "web",
"sub": "front",
"title": "frame",
"name": "vite",
"source": "/vite.jpg",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Vite for developing and managing 3 projects, achieving a beginner-level competency in development workflows within a 1-month timeframe."},
{"id": "18",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "typescript",
"source": "/ts.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Developed beginner-level TypeScript skills through hands-on experience developing and managing 3 projects over 1 month."},
{"id": "19",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "npm",
"source": "/npm.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "I have beginner-level proficiency in npm, gained through hands-on experience managing packages and dependencies in 3 projects over 1 month."},
{"id": "20",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "vs code",
"source": "/vs.jpg",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Visual Studio for developing and managing 3 projects, achieving a beginner-level competency in software development workflows within a 1-month timeframe."},
{"id": "21",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "git",
"source": "/git.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "3 Project",
"context": "Applied Git for managing code repositories and collaborating on 3 projects, achieving a beginner-level competency in version control workflows within a 1-month timeframe."},
{"id": "22",
"cat": "web",
"sub": "front",
"title": "libr",
"name": "github",
"source": "/github.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Applied GitHub for managing code repositories and collaborating on several college projects, achieving a beginner-level competency in version control workflows."},
{"id": "23",
"cat": "exe",
"sub": "soft",
"title": "lang",
"name": "csharp",
"source": "/cc.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have beginner-level proficiency in C#, gained through hands-on experience with multiple projects during college, demonstrating a foundational understanding of this language."},
{"id": "24",
"cat": "exe",
"sub": "soft",
"title": "lang",
"name": "cplus",
"source": "/ccc.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have beginner-level proficiency in VB6, gained through hands-on experience with multiple projects during college, demonstrating a foundational understanding of this language. Additionally, I have beginner-level proficiency in C++, gained through multiple projects during college."},
{"id": "25",
"cat": "exe",
"sub": "soft",
"title": "lang",
"name": "vb6",
"source": "/vb6.jpg",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have beginner-level proficiency in VB6, gained through hands-on experience with multiple projects during college, demonstrating a foundational understanding of this language."},
{"id": "26",
"cat": "exe",
"sub": "soft",
"title": "lang",
"name": "vba",
"source": "/vba.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Experienced in utilizing VBA for various projects during college, demonstrating a foundational understanding of this language."},
{"id": "27",
"cat": "exe",
"sub": "soft",
"title": "lang",
"name": "vb net",
"source": "/vbnet.jpg",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Applied VB.NET skills in several college projects, achieving a beginner-level competency in software development."},
{"id": "28",
"cat": "app",
"sub": "apk",
"title": "lang",
"name": "andriot studio",
"source": "/andr.jpg",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Developed beginner-level Android Studio skills through hands-on experience with multiple projects during my college education."},
{"id": "29",
"cat": "app",
"sub": "apk",
"title": "lang",
"name": "eclipse",
"source": "/eclips.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have beginner-level proficiency in Eclipse, gained through hands-on experience with multiple projects during college, demonstrating a foundational understanding of this IDE."},
{"id": "30",
"cat": "data",
"sub": "base",
"title": "db",
"name": "sql server",
"source": "/sqls.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "I have a beginner-level knowledge of SQL Server, having developed a foundational understanding of the platform and acquiring beginner-level skills during my college education."},
{"id": "31",
"cat": "data",
"sub": "base",
"title": "db",
"name": "mysql",
"source": "/dt2.png",
"level": "Beginner",
"exp": "College Days",
"proj": "2 Project",
"context": "Applied MySQL skills in several college projects, achieving a beginner-level competency in database administration and management."},
{"id": "32",
"cat": "data",
"sub": "base",
"title": "db",
"name": "phpmyadmin",
"source": "/dt4.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "Experienced in utilizing phpMyAdmin for various projects during college and until now, demonstrating a foundational understanding of database management."},
{"id": "33",
"cat": "data",
"sub": "base",
"title": "db",
"name": "postgresql",
"source": "/dt3.png",
"level": "Beginner",
"exp": "1 Month",
"proj": "0 Project",
"context": "I have a developing, beginner-level skillset in PostgreSQL, obtained through one month of dedicated learning, and I am enthusiastic about expanding my proficiency through hands-on experience."},
{"id": "34",
"cat": "data",
"sub": "base",
"title": "db",
"name": "ms access",
"source": "/dt1.png",
"level": "Beginner",
"exp": "College Days",
"proj": "Multiple Projects",
"context": "My college coursework involved the completion of multiple projects that allowed me to gain hands-on experience with MS Access, resulting in a beginner-level skillset and a practical understanding of database creation, organization, and basic manipulation."}
]
